---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SomeDimensionsLostWitnessLines
source: html/a1d07004-d8a5-661b-f985-6fbfe608de9d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SomeDimensionsLostWitnessLines Property

Some Dimensions lost some of their References on paste.

## Syntax (C#)
```csharp
public static FailureDefinitionId SomeDimensionsLostWitnessLines { get; }
```